/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#ifndef __APP_H_
#define __APP_H_

//========================================================================
//                                头文件
//========================================================================

#include	"config.h"
#include	"APP_Lamp.h"
#include	"APP_AD_UART.h"
#include	"APP_INT_UART.h"
#include	"APP_RTC.h"
#include	"APP_I2C_PS.h"
#include	"APP_SPI_PS.h"
#include	"APP_WDT.h"
#include	"APP_PWM.h"
#include	"APP_EEPROM.h"
#include	"APP_DMA_AD.h"
#include	"APP_DMA_M2M.h"
#include	"APP_DMA_UART.h"
#include	"APP_DMA_SPI_PS.h"
#include	"APP_DMA_LCM.h"
#include	"APP_DMA_I2C.h"
#include	"APP_CAN.h"
#include	"APP_LIN.h"
#include	"APP_USART_LIN.h"
#include	"APP_USART2_LIN.h"
#include	"APP_HSSPI.h"
#include	"APP_HSPWM.h"
//#include	"lcd.h"






//========================================================================
//                               本地常量声明	
//========================================================================



//========================================================================
//                            外部函数和变量声明
//========================================================================

void APP_config(void);

#endif
