/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#include "STC32G_DMA.h"
#include "STC32G_SPI.h"
#include "STC32G_LCM.h"


//========================================================================
// 函数: DMA_ADC_ISR_Handler
// 描述: DMA ADC 中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-23
//========================================================================
void DMA_ADC_ISR_Handler (void) interrupt DMA_ADC_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_M2M_ISR_Handler
// 描述: DMA M2M 中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-23
//========================================================================
void DMA_M2M_ISR_Handler (void) interrupt DMA_M2M_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_UART1TX_ISR_Handler
// 描述: DMA UART1 TX 中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-23
//========================================================================
void DMA_UART1TX_ISR_Handler (void) interrupt DMA_UR1T_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_UART1RX_ISR_Handler
// 描述: DMA UART1 RX 中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-23
//========================================================================
void DMA_UART1RX_ISR_Handler (void) interrupt DMA_UR1R_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_UART2TX_ISR_Handler
// 描述: DMA UART2 TX 中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-23
//========================================================================
void DMA_UART2TX_ISR_Handler (void) interrupt DMA_UR2T_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_UART2RX_ISR_Handler
// 描述: DMA UART2 RX 中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-23
//========================================================================
void DMA_UART2RX_ISR_Handler (void) interrupt DMA_UR2R_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_UART3TX_ISR_Handler
// 描述: DMA UART3 TX 中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-23
//========================================================================
void DMA_UART3TX_ISR_Handler (void) interrupt DMA_UR3T_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_UART3RX_ISR_Handler
// 描述: DMA UART3 RX 中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-23
//========================================================================
void DMA_UART3RX_ISR_Handler (void) interrupt DMA_UR3R_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_UART4TX_ISR_Handler
// 描述: DMA UART4 TX 中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-23
//========================================================================
void DMA_UART4TX_ISR_Handler (void) interrupt DMA_UR4T_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_UART4RX_ISR_Handler
// 描述: DMA UART4 RX 中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-23
//========================================================================
void DMA_UART4RX_ISR_Handler (void) interrupt DMA_UR4R_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_SPI_ISR_Handler
// 描述: DMA SPI 中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-23
//========================================================================
void DMA_SPI_ISR_Handler (void) interrupt DMA_SPI_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_I2C_ISR_Handler
// 描述: DMA I2C 发送中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-25
//========================================================================
void DMA_I2CT_ISR_Handler (void) interrupt DMA_I2CT_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_I2CR_ISR_Handler
// 描述: DMA I2C 接收中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-25
//========================================================================
void DMA_I2CR_ISR_Handler (void) interrupt DMA_I2CR_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_LCM_ISR_Handler
// 描述: DMA LCM 中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2022-03-23
//========================================================================
void DMA_LCM_ISR_Handler (void) interrupt DMA_LCM_VECTOR
{
	// TODO: 在此处添加用户代码

}

//========================================================================
// 函数: DMA_ISR_Handler
// 描述: DMA中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2021-05-25
//========================================================================
void DMA_ISR_Handler (void) interrupt 13
{
	// TODO: 在此处添加用户代码
	

}
